{
    "title": "Политика Конфиденциальности",
    "content": [
      {
        "title": "1. Название разработчика и контактная информация",
        "description": "Happy Games. Электронная почта: happygamesbot@gmail.com"
      },
      {
        "title": "2. Типы собираемых данных",
        "description": "Мы собираем и обрабатываем следующую информацию, предоставляемую пользователями через их аккаунты Telegram: • Имя пользователя • Отображаемое имя • Аватар (если установлен) • Номер телефона (если предоставлен пользователем) • Данные о действиях и прогрессе в игре (например, достижения) • Информация о взаимодействии пользователя с игрой (например, время, проведенное в игре, частота входа в систему)"
      },
      {
        "title": "3. Цели сбора данных",
        "description": "Собранные данные используются для следующих целей: • Регистрация и идентификация пользователя в игре • Улучшение качества игрового опыта • Отправка уведомлений и обновлений, связанных с игрой • Анализ игровых действий для улучшения геймплея и пользовательского опыта • Предоставление технической поддержки и ответов на запросы пользователей"
      },
      {
        "title": "4. Передача данных третьим сторонам",
        "description": "Мы передаем личные данные пользователей третьим сторонам только на основе добровольных действий самих пользователей, например, участие в задачах, требующих подписки на социальные сети наших партнеров."
      },
      {
        "title": "5. Защита данных",
        "description": "Мы принимаем все необходимые меры для защиты данных пользователей, включая использование стандартов шифрования AES-256, обеспечивая высокий уровень безопасности и конфиденциальности. Доступ к личным данным предоставляется только уполномоченным сотрудникам, которым необходима эта информация для выполнения своих обязанностей."
      },
      {
        "title": "6. Срок хранения данных",
        "description": "Данные пользователей хранятся в течение времени, необходимого для достижения целей, изложенных в этой политике конфиденциальности, или в соответствии с требованиями закона. Если пользователь желает удалить свой аккаунт, данные будут удалены в течение разумного срока."
      },
      {
        "title": "7. Права пользователей",
        "description": "Пользователи имеют право на доступ, исправление, удаление и ограничение обработки своих данных. Для реализации этих прав, пожалуйста, свяжитесь с нами по электронной почте: happygamesbot@gmail.com."
      },
      {
        "title": "8. Изменения в политике конфиденциальности",
        "description": "Мы оставляем за собой право вносить изменения в эту политику конфиденциальности. Мы уведомим пользователей о любых изменениях через приложение Happy Games. Мы рекомендуем периодически просматривать политику конфиденциальности, чтобы оставаться в курсе изменений."
      }
    ]
}
  