{
    "title": "Правила использования",
    "content": [
      {
        "title": "Добро пожаловать в Happy Games!",
        "description": "Используя нашу игру, вы соглашаетесь соблюдать данные Условия использования. Если вы не согласны с каким-либо положением, пожалуйста, воздержитесь от использования игры."
      },
      {
        "title": "1. Общие положения",
        "description": "1.1. Эти Условия использования регулируют ваш доступ к Telegram-приложению Happy Games (далее — 'Игра'). 1.2. Игра предоставляется компанией Happy Games (далее — 'Разработчик'). 1.3. Используя Игру, вы подтверждаете, что вам исполнилось 6 лет, и вы имеете право принимать эти Условия."
      },
      {
        "title": "2. Правила использования",
        "description": "2.1. Вы соглашаетесь использовать Игру только в соответствии с действующим законодательством и этими Условиями. 2.2. Запрещается: - Использовать Игру в незаконных целях. - Использовать автоматизированные средства (боты, скрипты) для взаимодействия с Игрой. - Распространять вредоносный контент или оскорблять других пользователей."
      },
      {
        "title": "3. Виртуальные товары и внутриигровые покупки",
        "description": "3.1. В Игре могут быть доступны виртуальные товары или функции, которые можно приобрести за реальные деньги. 3.2. Все покупки являются окончательными и не подлежат возврату, за исключением случаев, предусмотренных законом. 3.3. Разработчик оставляет за собой право изменять стоимость и доступность виртуальных товаров."
      },
      {
        "title": "4. Конфиденциальность",
        "description": "4.1. Использование Игры регулируется нашей Политикой конфиденциальности (вставить ссылку). 4.2. Мы можем собирать анонимные данные об использовании Игры с целью её улучшения."
      },
      {
        "title": "5. Ограничение ответственности",
        "description": "5.1. Игра предоставляется 'как есть' без каких-либо гарантий. 5.2. Разработчик не несет ответственности за: - Перебои в работе Игры. - Любые убытки или повреждения, возникшие в результате использования Игры."
      },
      {
        "title": "6. Изменения в Условиях",
        "description": "6.1. Мы оставляем за собой право изменять эти Условия в любое время. 6.2. Изменения вступают в силу после публикации обновленных Условий."
      },
      {
        "title": "7. Контактная информация",
        "description": "Если у вас есть вопросы по этим Условиям, свяжитесь с нами по адресу: happygamesbot@gmail.com."
      }
    ]
  }
  