{
    "title": "Політика Конфіденційності",
    "content": [
      {
        "title": "1. Назва розробника та контактна інформація",
        "description": "Happy Games. Електронна пошта: happygamesbot@gmail.com"
      },
      {
        "title": "2. Типи зібраних даних",
        "description": "Ми збираємо та обробляємо наступну інформацію, яку користувачі надають через свої акаунти Telegram: • Ім’я користувача • Відображуване ім’я • Аватар (якщо встановлено) • Номер телефону (якщо надано користувачем) • Дані про дії та прогрес у грі (наприклад, досягнення) • Інформація про взаємодію користувача з грою (наприклад, проведений у грі час, частота входу в систему)"
      },
      {
        "title": "3. Мета збору даних",
        "description": "Зібрані дані використовуються для наступних цілей: • Реєстрація користувача та ідентифікація у грі • Покращення якості ігрового досвіду • Надсилання сповіщень та оновлень, пов’язаних із грою • Аналіз ігрових дій для покращення геймплею та користувацького досвіду • Надання технічної підтримки та відповіді на запити користувачів"
      },
      {
        "title": "4. Обмін даними з третіми сторонами",
        "description": "Ми ділимося особистими даними користувачів із третіми сторонами лише на основі добровільних дій самих користувачів, наприклад, участь у завданнях, які вимагають підписки на соціальні мережі наших партнерів."
      },
      {
        "title": "5. Захист даних",
        "description": "Ми вживаємо всіх необхідних заходів для захисту даних користувачів, включаючи використання стандартів шифрування AES-256, забезпечуючи високий рівень безпеки та конфіденційності. Доступ до особистих даних надається лише уповноваженим співробітникам, яким потрібна ця інформація для виконання своїх обов’язків."
      },
      {
        "title": "6. Термін зберігання даних",
        "description": "Дані користувачів зберігаються протягом часу, необхідного для досягнення цілей, викладених у цій політиці конфіденційності, або відповідно до вимог закону. Якщо користувач бажає видалити свій акаунт, дані будуть видалені протягом розумного терміну."
      },
      {
        "title": "7. Права користувачів",
        "description": "Користувачі мають право на доступ, виправлення, видалення та обмеження обробки своїх даних. Для реалізації цих прав, будь ласка, зв’яжіться з нами за електронною поштою: happygamesbot@gmail.com."
      },
      {
        "title": "8. Зміни до політики конфіденційності",
        "description": "Ми залишаємо за собою право вносити зміни до цієї політики конфіденційності. Ми повідомимо користувачів про будь-які зміни через додаток Happy Games. Ми рекомендуємо періодично переглядати політику конфіденційності, щоб залишатися в курсі змін."
      }
    ]
  }
  