{
    "title": "Умови використання",
    "content": [
      {
        "title": "Ласкаво просимо до Happy Games!",
        "description": "Використовуючи нашу гру, ви погоджуєтесь дотримуватись цих Умов використання. Якщо ви не згодні з будь-яким положенням, будь ласка, утримайтесь від використання гри."
      },
      {
        "title": "1. Загальні положення",
        "description": "1.1. Ці Умови використання регулюють ваш доступ та використання Telegram-додатка Happy Games (далі — 'Гра'). 1.2. Гра надається компанією Happy Games (далі — 'Розробник'). 1.3. Використовуючи Гру, ви підтверджуєте, що вам виповнилося 6 років і ви маєте право приймати ці Умови."
      },
      {
        "title": "2. Правила використання",
        "description": "2.1. Ви погоджуєтесь використовувати Гру тільки відповідно до чинного законодавства та цих Умов. 2.2. Забороняється: - Використовувати Гру для незаконних цілей. - Використовувати автоматизовані засоби (боти, скрипти) для взаємодії з Грою. - Поширювати шкідливий контент або ображати інших користувачів."
      },
      {
        "title": "3. Віртуальні товари та внутрішньоігрові покупки",
        "description": "3.1. У Грі можуть бути доступні віртуальні товари або функції, які можна придбати за реальні гроші. 3.2. Усі покупки є остаточними та не підлягають поверненню, за винятком випадків, передбачених законодавством. 3.3. Розробник залишає за собою право змінювати вартість та доступність віртуальних товарів."
      },
      {
        "title": "4. Конфіденційність",
        "description": "4.1. Використання Гри регулюється нашою Політикою конфіденційності (вставити посилання). 4.2. Ми можемо збирати анонімні дані про використання Гри з метою її покращення."
      },
      {
        "title": "5. Обмеження відповідальності",
        "description": "5.1. Гра надається 'як є' без будь-яких гарантій. 5.2. Розробник не несе відповідальності за: - Перебої в роботі Гри. - Будь-які втрати чи збитки, що виникли внаслідок використання Гри."
      },
      {
        "title": "6. Зміни в Умовах",
        "description": "6.1. Ми залишаємо за собою право змінювати ці Умови в будь-який час. 6.2. Зміни набувають чинності після публікації оновлених Умов."
      },
      {
        "title": "7. Контактна інформація",
        "description": "Якщо у вас є питання щодо цих Умов, зв’яжіться з нами за адресою: happygamesbot@gmail.com."
      }
    ]
  }
  