{
    "title": "Terms Of Use",
    "content": [
      {
        "title": "Welcome to Happy Games!",
        "description": "By using our game, you agree to comply with these Terms of Use. If you do not agree with any provision, please refrain from using the game."
      },
      {
        "title": "1. General Provisions",
        "description": "1.1. These Terms of Use govern your access to and use of the Telegram application Happy Games (hereinafter referred to as 'Game'). 1.2. The Game is provided by Happy Games (hereinafter referred to as 'Developer'). 1.3. By using the Game, you confirm that you are at least 6 years old and are authorized to accept these Terms."
      },
      {
        "title": "2. Rules of Use",
        "description": "2.1. You agree to use the Game only in accordance with applicable laws and these Terms. 2.2. It is prohibited to: - Use the Game for illegal purposes. - Use automated tools (bots, scripts) to interact with the Game. - Spread harmful content or offend other users."
      },
      {
        "title": "3. Virtual Goods and In-Game Purchases",
        "description": "3.1. The Game may include virtual goods or features available for real money. 3.2. All purchases are final and non-refundable, except as required by law. 3.3. The Developer reserves the right to change the cost and availability of virtual goods."
      },
      {
        "title": "4. Privacy",
        "description": "4.1. The use of the Game is governed by our Privacy Policy (insert link). 4.2. We may collect anonymous data about the use of the Game to improve it."
      },
      {
        "title": "5. Limitation of Liability",
        "description": "5.1. The Game is provided 'as is' without any warranties. 5.2. The Developer is not liable for: - Interruptions in the operation of the Game. - Any losses or damages arising from the use of the Game."
      },
      {
        "title": "6. Changes to the Terms",
        "description": "6.1. We reserve the right to change these Terms at any time. 6.2. Changes take effect upon publication of the updated Terms."
      },
      {
        "title": "7. Contact Information",
        "description": "If you have any questions about these Terms, please contact us at: happygamesbot@gmail.com."
      }
    ]
  }
  